// Дерево — это нелинейная иерархическая структура данных. 
// Она состоит из узлов и ребер, которые соединяют узлы.

// Части дерева
// Узел — это объект, в котором есть ключ или значение и указатели на дочерние узлы. 
// Узлы, у которых нет дочерних узлов, называют листами или терминальными узлами. 
// Узлы, у которых есть хотя бы один дочерний узел, называются внутренними.
// Ребро связывает два узла.
// Корень — это самый верхний узел дерева. Его ещё иногда называют корневым узлом.


// Другие понятия
// Высота узла — это максимальная длина пути от этого узла к самому нижнему узлу (листу).
// Глубина вложенности узла — длина пути от корня до этого узла.
// Высота дерева —  это высота корневого узла или глубина самого глубокого узла. 
// Степень узла — это общее количество ребер, которые соединены с этим узлом.

// Лес — множество непересекающихся деревьев. Например, если «срезать» корень, получится лес. 

// Разновидности
// Двоичное дерево.
// Дерево двоичного поиска.
// АВЛ-дерево.
// B-дерево.

// Где используются
// Деревья двоичного поиска помогают быстро проверить наличие элемента в наборе.
// Куча — это тоже своеобразное дерево. Кучи используют в алгоритме сортировки кучей.
// Префиксные деревья используются в маршрутизаторах, они хранят информацию о маршруте. 
// Большинство популярных баз данных основаны на B-деревья и T-деревья.
// Компиляторы используют абстрактное синтаксическое дерево, чтобы находить 
// синтаксические ошибки в ваших программах. 